tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble/ble_pub/plf/refip/src/build/ble_full/reg/fw/reg_ble_em_cs.h
// field definitions
#define BLE_RXCCMPKTCNT1_MASK   ((uint16_t)0x0000FFFF)
#define BLE_RXCCMPKTCNT1_LSB    0
#define BLE_RXCCMPKTCNT1_WIDTH  ((uint16_t)0x00000010)

#define BLE_RXCCMPKTCNT1_RST    0x0

__INLINE uint16_t ble_rxccmpktcnt1_getf(int elt_idx)
{
    uint16_t localVal = EM_BLE_RD(BLE_RXCCMPKTCNT1_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
    ASSERT_ERR((localVal & ~((uint16_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_rxccmpktcnt1_setf(int elt_idx, uint16_t rxccmpktcnt1)
{
    ASSERT_ERR((((uint16_t)rxccmpktcnt1 << 0) & ~((uint16_t)0x0000FFFF)) == 0);
    EM_BLE_WR(BLE_RXCCMPKTCNT1_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, (uint16_t)rxccmpktcnt1 << 0);
}

/**
 * @brief RXCCMPKTCNT2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  06:00         RXCCMPKTCNT2   0x0
 * </pre>
 */
#define BLE_RXCCMPKTCNT2_ADDR   (0x0081404A + EM_BLE_CS_OFFSET)
#define BLE_RXCCMPKTCNT2_INDEX  0x00000025
#define BLE_RXCCMPKTCNT2_RESET  0x00000000

__INLINE uint16_t ble_rxccmpktcnt2_get(int elt_idx)
{
    return EM_BLE_RD(BLE_RXCCMPKTCNT2_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
}

__INLINE void ble_rxccmpktcnt2_set(int elt_idx, uint16_t value)
{
    EM_BLE_WR(BLE_RXCCMPKTCNT2_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, value);
}

// field definitions
#define BLE_RXCCMPKTCNT2_MASK   ((uint16_t)0x0000007F)
#define BLE_RXCCMPKTCNT2_LSB    0
#define BLE_RXCCMPKTCNT2_WIDTH  ((uint16_t)0x00000007)

#define BLE_RXCCMPKTCNT2_RST    0x0

__INLINE uint8_t ble_rxccmpktcnt2_getf(int elt_idx)
{
    uint16_t localVal = EM_BLE_RD(BLE_RXCCMPKTCNT2_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
    ASSERT_ERR((localVal & ~((uint16_t)0x0000007F)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_rxccmpktcnt2_setf(int elt_idx, uint8_t rxccmpktcnt2)
{
    ASSERT_ERR((((uint16_t)rxccmpktcnt2 << 0) & ~((uint16_t)0x0000007F)) == 0);
    EM_BLE_WR(BLE_RXCCMPKTCNT2_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, (uint16_t)rxccmpktcnt2 << 0);
}

/**
 * @brief EVTCNT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00              EVT_CNT   0x0
 * </pre>
 */
#define BLE_EVTCNT_ADDR   (0x0081404C + EM_BLE_CS_OFFSET)
#define BLE_EVTCNT_INDEX  0x00000026
#define BLE_EVTCNT_RESET  0x00000000

__INLINE uint16_t ble_evtcnt_get(int elt_idx)
{
    return EM_BLE_RD(BLE_EVTCNT_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
}

__INLINE void ble_evtcnt_set(int elt_idx, uint16_t value)
{
    EM_BLE_WR(BLE_EVTCNT_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, value);
}

// field definitions
#define BLE_EVT_CNT_MASK   ((uint16_t)0x0000FFFF)
#define BLE_EVT_CNT_LSB    0
#define BLE_EVT_CNT_WIDTH  ((uint16_t)0x00000010)

#define BLE_EVT_CNT_RST    0x0

__INLINE uint16_t ble_evt_cnt_getf(int elt_idx)
{
    uint16_t localVal = EM_BLE_RD(BLE_EVTCNT_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
    ASSERT_ERR((localVal & ~((uint16_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_evt_cnt_setf(int elt_idx, uint16_t evtcnt)
{
    ASSERT_ERR((((uint16_t)evtcnt << 0) & ~((uint16_t)0x0000FFFF)) == 0);
    EM_BLE_WR(BLE_EVTCNT_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, (uint16_t)evtcnt << 0);
}

/**
 * @brief ISOTXRXCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     15       ISORXBUFF_FULL   0
 *     14         ISOLASTEMPTY   0
 *     13                ISOMD   0
 *     12                ISOSN   0
 *     11              ISONESN   0
 *     09              ISORETX   0
 *     08              ISORSVD   0
 *     03           ISOWAITACK   0
 *     02            ISOLASTMD   0
 *     01          ISOLASTNESN   0
 *     00            ISOLASTSN   0
 * </pre>
 */
#define BLE_ISOTXRXCNTL_ADDR   (0x0081404E + EM_BLE_CS_OFFSET)
#define BLE_ISOTXRXCNTL_INDEX  0x00000027
#define BLE_ISOTXRXCNTL_RESET  0x00000000

__INLINE uint16_t ble_isotxrxcntl_get(int elt_idx)
{
    return EM_BLE_RD(BLE_ISOTXRXCNTL_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);
}

__INLINE void ble_isotxrxcntl_set(int elt_idx, uint16_t value)
{
    EM_BLE_WR(BLE_ISOTXRXCNTL_ADDR + elt_idx * REG_BLE_EM_CS_SIZE, value);
}

// field definitions
#define BLE_ISORXBUFF_FULL_BIT    ((uint16_t)0x00008000)
#define BLE_ISORXBUFF_FULL_POS    15
#define BLE_ISOLASTEMPTY_BIT      ((uint16_t)0x00004000)
#define BLE_ISOLASTEMPTY_POS      14
#define BLE_ISOMD_BIT             ((uint16_t)0x00002000)
#define BLE_ISOMD_POS             13
#define BLE_ISOSN_BIT             ((uint16_t)0x00001000)
#define BLE_ISOSN_POS             12
#define BLE_ISONESN_BIT           ((uint16_t)0x00000800)
#define BLE_ISONESN_POS           11
#define BLE_ISORETX_BIT           ((uint16_t)0x00000200)
#define BLE_ISORETX_POS           9
#define BLE_ISORSVD_BIT           ((uint16_t)0x00000100)
#define BLE_ISORSVD_POS           8
#define BLE_ISOWAITACK_BIT        ((uint16_t)0x00000008)
#define BLE_ISOWAITACK_POS        3
#define BLE_ISOLASTMD_BIT         ((uint16_t)0x00000004)
#define BLE_ISOLASTMD_POS         2
#define BLE_ISOLASTNESN_BIT       ((uint16_t)0x00000002)
#define BLE_ISOLASTNESN_POS       1
#define BLE_ISOLASTSN_BIT         ((uint16_t)0x00000001)
#define BLE_ISOLASTSN_POS         0

#define BLE_ISORXBUFF_FULL_RST    0x0
#define BLE_ISOLASTEMPTY_RST      0x0
#define BLE_ISOMD_RST             0x0
#define BLE_ISOSN_RST             0x0
#define BLE_ISONESN_RST           0x0
#define BLE_ISORETX_RST           0x0
#define BLE_ISORSVD_RST           0x0
#define BLE_ISOWAITACK_RST        0x0
#define BLE_ISOLASTMD_RST         0x0
#define BLE_ISOLASTNESN_RST       0x0
#define BLE_ISOLASTSN_RST         0x0

__INLINE void ble_isotxrxcntl_pack(int elt_idx, uint8_t isorxbufffull, uint8_t isolastempty, uint8_t isomd, uint8_t isosn, uint8_t isonesn, uint8_t isoretx, uint8_t isorsvd, uint8_t isowaitack, uint8_t isolastmd, uint8_t isolastnesn, uint8_t isolastsn)
{
    ASSERT_ERR((((uint16_t)isorxbufffull << 15) & ~((uint16_t)0x00008000)) == 0);
    ASSERT_ERR((((uint16_t)isolastempty << 14) & ~((uint16_t)0x00004000)) == 0);
    ASSERT_ERR((((uint16_t)isomd << 13) & ~((uint16_t)0x00002000)) == 0);
    ASSERT_ERR((((uint16_t)isosn << 12) & ~((uint16_t)0x00001000)) == 0);
    ASSERT_ERR((((uint16_t)isonesn << 11) & ~((uint16_t)0x00000800)) == 0);
    ASSERT_ERR((((uint16_t)isoretx << 9) & ~((uint16_t)0x00000200)) == 0);
    ASSERT_ERR((((uint16_t)isorsvd << 8) & ~((uint16_t)0x00000100)) == 0);
    ASSERT_ERR((((uint16_t)isowaitack << 3) & ~((uint16_t)0x00000008)) == 0);
    ASSERT_ERR((((uint16_t)isolastmd << 2) & ~((uint16_t)0x00000004)) == 0);
    ASSERT_ERR((((uint16_t)isolastnesn << 1) & ~((uint16_t)0x00000002)) == 0);
    ASSERT_ERR((((uint16_t)isolastsn << 0) & ~((uint16_t)0x00000001)) == 0);
    EM_BLE_WR(BLE_ISOTXRXCNTL_ADDR + elt_idx * REG_BLE_EM_CS_SIZE,  ((uint16_t)isorxbufffull << 15) | ((uint16_t)isolastempty << 14) | ((uint16_t)isomd << 13) | ((uint16_t)isosn << 12) | ((uint16_t)isonesn << 11) | ((uint16_t)isoretx << 9) | ((uint16_t)isorsvd << 8) | ((uint16_t)isowaitack << 3) | ((uint16_t)isolastmd << 2) | ((uint16_t)isolastnesn << 1) | ((uint16_t)isolastsn << 0));
}

__INLINE void ble_isotxrxcntl_unpack(int elt_idx, uint8_t* isorxbufffull, uint8_t* isolastempty, uint8_t* isomd, uint8_t* isosn, uint8_t* isonesn, uint8_t* isoretx, uint8_t* isorsvd, uint8_t* isowaitack, uint8_t* isolastmd, uint8_t* isolastnesn, uint8_t* isolastsn)
{
    uint16_t localVal = EM_BLE_RD(BLE_ISOTXRXCNTL_ADDR + elt_idx * REG_BLE_EM_CS_SIZE);

